IDENTIFICATION DIVISION. 
PROGRAM-ID. PRIME-NUMBERS.

DATA DIVISION.
    WORKING-STORAGE SECTION. 
    01 WS-NUMBER	PIC 9(3).

PROCEDURE DIVISION.
 DISPLAY "PRINT NUMBERS FROM 1 TO 100:". 
 PERFORM VARYING WS-NUMBER FROM 1 BY 1 UNTIL WS-NUMBER>100
    DISPLAY WS-NUMBER
 END-PERFORM.
STOP RUN.