IDENTIFICATION DIVISION. 
    PROGRAM-ID. LARGEST.

DATA DIVISION.
    WORKING-STORAGE SECTION. 
        01 WS-A	PIC 9(4).
        01 WS-B	PIC 9(4).
        01 WS-C	PIC 9(4).
        01 WS-LARGEST PIC 9(4).


PROCEDURE DIVISION.
    ACCEPT WS-A.
    DISPLAY "ENTER FIRST NUMBER: "WS-A. ACCEPT WS-B.
    DISPLAY "ENTER SECOND NUMBER: "WS-B. ACCEPT WS-C.
    DISPLAY "ENTER THIRD NUMBER: "WS-C.
        IF WS-A >= WS-B AND WS-A >= WS-C MOVE WS-A TO WS-LARGEST
        ELSE
            IF WS-B >= WS-A AND WS-B >= WS-C MOVE WS-B TO WS-LARGEST
            ELSE
            MOVE WS-C TO WS-LARGEST 
            END-IF
        END-IF.
    DISPLAY "LARGEST NUMBER IS: " WS-LARGEST. 
STOP RUN.
