IDENTIFICATION DIVISION. 
  PROGRAM-ID. SIMPLE-INTEREST.
   
DATA DIVISION.
  WORKING-STORAGE SECTION.
    01 WS-PRINCIPAL	PIC 9(7)V9(2).
    01 WS-RATE	PIC 9(3)V9(2).
    01 WS-TIME	PIC 9(3)V9(2).
    01 WS-SI	PIC 9(9)V9(2).

PROCEDURE DIVISION. 
  ACCEPT WS-PRINCIPAL.
  DISPLAY "ENTER PRINCIPAL AMOUNT: "WS-PRINCIPAL. 
  ACCEPT WS-RATE.
  DISPLAY "ENTER RATE OF INTEREST: "WS-RATE. 
  ACCEPT WS-TIME.
  DISPLAY "ENTER TIME (IN YEARS): "WS-TIME. 
  COMPUTE WS-SI = (WS-PRINCIPAL * WS-RATE * WS-TIME) / 100.
  DISPLAY "SIMPLE INTEREST IS: " WS-SI. 
STOP RUN.