IDENTIFICATION DIVISION.
PROGRAM-ID. palindrome.  

DATA DIVISION.
    WORKING-STORAGE SECTION. 
        01 WS-NUMBER	PIC 9(5).
        01 WS-TEMP	PIC 9(5).
        01 WS-REVERSE	PIC 9(5) VALUE 0.
        01 WS-DIGIT	PIC 9.

PROCEDURE DIVISION. 
    ACCEPT WS-NUMBER.
    DISPLAY "ENTER A NUMBER: "WS-NUMBER. 
    MOVE WS-NUMBER TO WS-TEMP.
        PERFORM UNTIL WS-TEMP = 0 DIVIDE WS-TEMP BY 10
        GIVING WS-TEMP REMAINDER WS-DIGIT
        COMPUTE WS-REVERSE =
        (WS-REVERSE * 10) + WS-DIGIT 
        END-PERFORM.
    IF WS-NUMBER = WS-REVERSE
    DISPLAY "IT IS A PALINDROME NUMBER" 
    ELSE DISPLAY "IT IS NOT A PALINDROME NUMBER" 
    END-IF.
STOP RUN.