IDENTIFICATION DIVISION. 
PROGRAM-ID. FACTORIAL.

ENVIRONMENT DIVISION. 
      CONFIGURATION SECTION. 
       SOURCE-COMPUTER. IBM-3278. 
       OBJECT-COMPUTER. IBM-3278.

DATA DIVISION.
      WORKING-STORAGE SECTION. 
       01 WS-NUMBER	PIC 9(3).
       01 WS-COUNTER	PIC 9(3).
       01 WS-FACTORIAL PIC 9(3) VALUE 1.
PROCEDURE DIVISION. 
      ACCEPT WS-NUMBER.
      DISPLAY "ENTER A NUMBER: "WS-NUMBER. 
      PERFORM VARYING WS-COUNTER FROM 1 BY 1
            UNTIL WS-COUNTER > WS-NUMBER COMPUTE WS-FACTORIAL =
             WS-FACTORIAL * WS-COUNTER END-PERFORM.
      DISPLAY "FACTORIAL IS: " WS-FACTORIAL.
STOP RUN. 