IDENTIFICATION DIVISION. 
    PROGRAM-ID. REVERSE-NUMBER.

DATA DIVISION.
    WORKING-STORAGE SECTION. 
        01 WS-NUMBER	PIC 9(5).
        01 WS-REVERSE	PIC 9(5) VALUE 0.
        01 WS-DIGIT	PIC 9.
        01 WS-COUNT	PIC 9 VALUE 1.

PROCEDURE DIVISION. 
    ACCEPT WS-NUMBER.
    DISPLAY "ENTER A 5 DIGIT NUMBER: "WS-NUMBER.
        PERFORM UNTIL WS-COUNT > 5 DIVIDE WS-NUMBER BY 10
        GIVING WS-NUMBER REMAINDER WS-DIGIT
        COMPUTE WS-REVERSE =
        (WS-REVERSE * 10) + WS-DIGIT
        ADD 1 TO WS-COUNT 
        END-PERFORM.
    DISPLAY "REVERSED NUMBER IS: " WS-REVERSE. 
STOP RUN.