IDENTIFICATION DIVISION.
    PROGRAM-ID. DIVISIBLE.

DATA DIVISION.
    WORKING-STORAGE SECTION. 
        01 WS-NUMBER PIC 9(4).
        01 WS-REM2	PIC 9(4).
        01 WS-REM3	PIC 9(4).
        01 WS-REM17	PIC 9(4).
        01 WS-DUMMY	PIC 9(4).


PROCEDURE DIVISION.
    DISPLAY "NUMBERS FROM 1 TO 1000 DIVISIBLE BY 2, 3 AND 17:". 
        PERFORM VARYING WS-NUMBER FROM 1 BY 1
        UNTIL WS-NUMBER > 1000
        DIVIDE WS-NUMBER BY 2 GIVING WS-DUMMY REMAINDER WS-REM2
        DIVIDE WS-NUMBER BY 3 GIVING WS-DUMMY REMAINDER WS-REM3
        DIVIDE WS-NUMBER BY 17 GIVING WS-DUMMY REMAINDER WS-REM17
            IF WS-REM2 = 0 AND WS-REM3 = 0 AND WS-REM17 = 0
            DISPLAY WS-NUMBER 
            END-IF
        END-PERFORM. 
STOP RUN.