IDENTIFICATION DIVISION.
PROGRAM-ID. SUM-USING-OCCURS.

DATA DIVISION.
    WORKING-STORAGE SECTION. 
        01 WS-NUMBERS.
        05 WS-NUMBER  PIC 9(4) OCCURS 20 TIMES.
        01 WS-INDEX	PIC 9(2).
        01 WS-SUM	PIC 9(6) VALUE 0.

PROCEDURE DIVISION.
    DISPLAY "ENTER 20 NUMBERS:".
    PERFORM VARYING WS-INDEX FROM 1 BY 1 UNTIL WS-INDEX > 20
    ACCEPT WS-NUMBER (WS-INDEX) 
    END-PERFORM.
    PERFORM VARYING WS-INDEX FROM 1 BY 1 UNTIL WS-INDEX > 20
    ADD WS-NUMBER (WS-INDEX) TO WS-SUM 
    END-PERFORM.
    DISPLAY "SUM OF 20 NUMBERS IS: " WS-SUM. 
STOP RUN.