IDENTIFICATION DIVISION.
PROGRAM-ID. CELSIUS-TO-FAHRENHEIT.

ENVIRONMENT DIVISION. 
    CONFIGURATION SECTION. 
        SOURCE-COMPUTER. IBM-3278. 
        OBJECT-COMPUTER. IBM-3278.

DATA DIVISION.
    WORKING-STORAGE SECTION. 
        01 WS-CELSIUS	PIC 9(3)V9(2).
        01 WS-FAHRENHEIT PIC 9(3)V9(2). 
PROCEDURE DIVISION.
      ACCEPT WS-CELSIUS.
      DISPLAY "ENTER TEMPERATURE IN CELSIUS: "WS-CELSIUS. 
      COMPUTE WS-FAHRENHEIT =(WS-CELSIUS * 9 / 5) + 32.
      DISPLAY "TEMPERATURE IN FAHRENHEIT: "WS-FAHRENHEIT. 
STOP RUN.